ja/2026.07.07.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="2026.06.30.html">先週号</a> <a href="index.html">上へ</a> <a href="2026.07.14.html">次週号</a>
</p>

<p>
こんにちは
</p>

<p>
2026年6月30日から7月7日までの週の OCaml Weekly News をお届けします。
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">opam-minver 0.2.0 — 依存関係の最小バージョンを自動的に特定する</a></li>
<li><a href="#2">Zanuda — OCaml linter 実験</a></li>
<li><a href="#3">rpgm-decrypt — OCaml による形式検証済み RPG Maker アセット復号化ツール</a></li>
<li><a href="#4">menhirformat 0.1.0</a></li>
<li><a href="#5">Solo5 0.12.0</a></li>
<li><a href="#6">Landmarks 1.7</a></li>
<li><a href="#7">Ocsigen が（今のところ）Lwt を使い続ける理由</a></li>
<li><a href="#8">Dune 3.24</a></li>
<li><a href="#org5844e52">過去の CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">opam-minver 0.2.0 — 依存関係の最小バージョンを自動的に特定する</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-opam-minver-0-2-0-automatically-determine-minimum-dependency-versions/18328/1">https://discuss.ocaml.org/t/ann-opam-minver-0-2-0-automatically-determine-minimum-dependency-versions/18328/1</a>
</p>
</div>

<div id="outline-container-org0ccf6ed" class="outline-3">
<h3 id="org0ccf6ed">onetimerobot が発表しました</h3>
<div class="outline-text-3" id="text-org0ccf6ed">
<p>
opam-minver 0.2.0 を公開しました（以前のバージョンは一般公開されていませんでした）。このツールは二分探索を使用して、プロジェクトの opam ファイルに記載された依存関係の最小通過バージョンを見つけ出し、必要に応じて opam ファイルに直接書き出します。別のプロジェクト（まだ未公開）に取り組んでいたとき、すべての依存関係を列挙した後、どのバージョンと互換性があるのか全くわからないことに気づき、このツールを作成しました。このツールはそれを自動的に調べてくれます。
</p>

<p>
現時点でかなり洗練されており、cmdliner インターフェースを持ち、状態を json ファイルに保存するためセッションを再開できるほか、最小コンパイラバージョンを特定し、たとえばプロジェクトが初期の OCaml 5 バージョンで動作しない場合などの分割された OCaml コンパイラバージョン境界も処理します。これは新規プロジェクトだけでなく、バージョン境界が正確に決定されていない既存プロジェクトのバージョン制約を緩和するためにも使用できます。
</p>

<p>
ホームページと README はこちら: <a href="https://github.com/luminous-moose/opam-minver">https://github.com/luminous-moose/opam-minver</a>
</p>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">Zanuda — OCaml linter 実験</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-zanuda-ocaml-linter-experiment/11784/14">https://discuss.ocaml.org/t/ann-zanuda-ocaml-linter-experiment/11784/14</a>
</p>
</div>

<div id="outline-container-org1057dc6" class="outline-3">
<h3 id="org1057dc6">このスレッドを継続して、Kakadu が発表しました</h3>
<div class="outline-text-3" id="text-org1057dc6">
<p>
Zanuda 2.1.0 が opam-repository にマージされました
</p>

<ul class="org-ul">
<li>OCaml 5.5 サポート</li>
<li>lint を <code>[@@@zanuda "-name"]</code> で無効化できるようになりました</li>
<li>ocamlfind パッケージとして表現された lint をランタイムにロードし、zanuda コードベース外で定義できるようになりました。このモジュール性は現時点では実験的です。</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">rpgm-decrypt — OCaml による形式検証済み RPG Maker アセット復号化ツール</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-rpgm-decrypt-a-formally-verified-rpg-maker-asset-decryptor-in-ocaml/18324/1">https://discuss.ocaml.org/t/ann-rpgm-decrypt-a-formally-verified-rpg-maker-asset-decryptor-in-ocaml/18324/1</a>
</p>
</div>

<div id="outline-container-org1925932" class="outline-3">
<h3 id="org1925932">LulLaS が発表しました</h3>
<div class="outline-text-3" id="text-org1925932">
<p>
皆さん、こんにちは))) :slightly_smiling_face: 
</p>

<p>
<b>rpgm-decrypt</b> を紹介します。これは RPG Maker のアセットアーカイブ（XP / VX / VX Ace の <code>.rgssad</code> / <code>.rgss2a</code> / <code>.rgss3a</code>、および MV / MZ の XOR 暗号化アセットと <code>.pak</code> アーカイブ）を復号化・展開する小さなコマンドラインツールです。
</p>

<p>
クリーンルーム再実装として始まりましたが、実際のプロジェクトで OCaml の正確性検証ツールをできる限り活用する機会になりました：
</p>

<ul class="org-ul">
<li>純粋なコア部分への <b>Gospel</b> 仕様（<code>.mli</code> 内の <code>(*@ ... *)</code>）</li>
<li>鍵導出、リトルエンディアン読み取り、Zip-Slip パス安全性不変条件の <b>Why3 + Z3</b> による演繹的証明（23/23 ゴール解決）</li>
<li>ユニットテストスイートと並行した <b>QCheck</b> プロパティテスト（ラウンドトリップ／不変条件）</li>
<li>CI でのパーサに対するカバレッジガード付き <b>afl-fuzz</b>（クラッシュなし）</li>
<li><b>bisect_ppx</b> カバレッジ + 小規模な指向性ミューテーションテストパス</li>
<li><code>dune --profile static</code> による単一静的バイナリとして配布。外部依存は MZ <code>.pak</code> パス用の <code>camlzip</code>（zlib）のみ</li>
</ul>

<p>
ネイティブ Windows OCaml スイッチと Linux の両方でビルド・テストが動作します。
Apache-2.0 ライセンス。
</p>

<p>
実行例：
</p>

<pre class="example" id="org82a3551">
$ rpgm-decrypt "MyGame" out
scanned=1817 decrypted=1685 passthrough=132 skipped=0 failed=0 formats=[MV=1817]
</pre>

<p>
リポジトリ、ドキュメント、Windows/Linux 用ビルド済みバイナリ：
</p>

<p>
<a href="https://github.com/rolanfreeman6-png/rpgm-decrypt">https://github.com/rolanfreeman6-png/rpgm-decrypt</a>
</p>

<p>
spec/proof のセットアップに関するフィードバックを特に歓迎します — Gospel + Why3 を本格的に使うのは今回が初めてなので、実際のコードでどのように構成するか、ぜひ聞かせてください。
</p>
</div>
</div>
</div>




<div id="outline-container-4" class="outline-2">
<h2 id="4">menhirformat 0.1.0</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-menhirformat-0-1-0/18322/1">https://discuss.ocaml.org/t/ann-menhirformat-0-1-0/18322/1</a>
</p>
</div>

<div id="outline-container-org411e243" class="outline-3">
<h3 id="org411e243">Federico が発表しました</h3>
<div class="outline-text-3" id="text-org411e243">
<p>
こんにちは、
</p>

<p>
<code>menhirformat</code> の最初のリリースを発表できることをうれしく思います。これは Menhir と ocamllex のソースコードをフォーマット・インデントするコマンドラインツールです。<a href="https://ocaml.org/p/ocamlformat-rpc-lib/latest">ocamlformat RPC</a> を使用してレキサーやパーサの OCaml セクションをきれいに出力します。またコメントの元の位置をできる限り保持しようとします（ただし、この点はまだ改善が必要です）。
</p>

<p>
これは、この 2 つの OCaml 方言に LSP サポートを追加するという、進行中の大規模プロジェクト <a href="https://github.com/dalps/menhir-lsp"><code>menhir-lsp</code></a> の衛星プロジェクトです。フォーマット機能はもともと LSP サーバーにドキュメントフォーマットリクエストを処理するために組み込まれていましたが、<a href="https://github.com/dalps/menhir-lsp/issues/25">この issue</a> を受けてスタンドアロンアプリケーションとして分離しました。
</p>

<p>
<code>opam install menhirformat</code> でお試しいただけます。CLI は ocamlformat に大きく触発されており、フォーマットするファイルを引数として受け取ります（例: <code>menhirformat calc.mly</code>）。フォーマッタの動作を調整できる小さな設定を公開しています。使用可能なオプションは <code>menhirformat --help</code> で確認できます。
</p>

<p>
また、Menhir と ocamllex 用の <a href="https://dune.readthedocs.io/en/latest/reference/dune-project/dialect.html#dialect">dialects</a> を設定することで、dune プロジェクトに統合することもできます：
</p>

<pre class="example" id="org929f474">
(dialect
 (name menhir)
 (implementation
  (extension mly)
  (format
   (run menhirformat %{input-file}))))

(dialect
 (name ocamllex)
 (implementation
  (extension mll)
  (format
   (run menhirformat %{input-file}))))
</pre>

<p>
その後 <code>dune build @fmt</code> を実行すると、プロジェクトの .mll ファイルと .mly ファイルがフォーマットされ、差分が表示されます。
</p>

<p>
IDE でのフォーマット保存なしには生きていけない人間として、OCaml エコシステムに Menhir と ocamllex ファイル向けのフォーマッタが存在しないことをずっと寂しく感じていました。<code>menhirformat</code> がその空白を埋めることを願っています。
</p>

<p>
出力の品質についてのご意見や、設定のカスタマイズポイントに関するご提案をお待ちしています。以下にコメントするか、GitHub の issue からお知らせください！
</p>

<ul class="org-ul">
<li>opam ページ: <a href="https://ocaml.org/p/menhirformat/latest">https://ocaml.org/p/menhirformat/latest</a></li>
<li>ソースコード: <a href="https://github.com/dalps/menhir-lsp/tree/main/prettyprint">https://github.com/dalps/menhir-lsp/tree/main/prettyprint</a></li>
</ul>

<p>
お楽しみください！
</p>
</div>
</div>
</div>




<div id="outline-container-5" class="outline-2">
<h2 id="5">Solo5 0.12.0</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-solo5-0-12-0/18320/1">https://discuss.ocaml.org/t/ann-solo5-0-12-0/18320/1</a>
</p>
</div>

<div id="outline-container-orge184bee" class="outline-3">
<h3 id="orge184bee">Hannes Mehnert が発表しました</h3>
<div class="outline-text-3" id="text-orge184bee">
<p>
<a href="https://github.com/Solo5/solo5/releases/tag/v0.12.0">Solo5 0.12.0</a> のリリースをお知らせできることを嬉しく思います。このリリースには 2 つの重要な機能があります。初めての貢献者 Michael Neumann による <a href="https://github.com/Solo5/solo5/pull/640">DragonFlyBSD nvmm 向けの新しい hvt バックエンド</a>と、<a href="https://github.com/Solo5/solo5/pull/647">virtio ユニカーネルのソフトパワーオフ</a> — <a href="https://github.com/Solo5/solo5/issues/499">長年のフィーチャーリクエスト</a> で、solo5 を Google Compute などで使用する際に大幅に改善されます。これはもともと Michael Bacarella がドラフト実装を含めてリクエストし、Romain Calascibetta が<a href="https://github.com/Solo5/solo5/pull/647">実装</a>してマージされました。
</p>

<p>
その他の注目すべき修正として、<code>configure.sh</code> が <a href="https://github.com/Solo5/solo5/pull/645">C コンパイラのバージョンを確認</a> するようになり、GCC バージョン 9 以上または clang バージョン 10 以上が必要となりました。<code>solo5-hvt-debug</code> は（solo5 0.11.0 以降）厳しすぎる seccomp ルールが適用されてクラッシュしていました — Felix Solcher が<a href="https://github.com/Solo5/solo5/issues/643">issue</a> を開き、再び Romain Calascibetta が<a href="https://github.com/Solo5/solo5/pull/644">修正</a>してくれました。
</p>

<p>
opam-repository へのマージ待ち: <a href="https://github.com/ocaml/opam-repository/pull/30182">https://github.com/ocaml/opam-repository/pull/30182</a>
</p>
</div>
</div>
</div>




<div id="outline-container-6" class="outline-2">
<h2 id="6">Landmarks 1.7</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-landmarks-1-7/18319/1">https://discuss.ocaml.org/t/ann-landmarks-1-7/18319/1</a>
</p>
</div>

<div id="outline-container-org1a26558" class="outline-3">
<h3 id="org1a26558">Nicolas Ojeda Bar が発表しました</h3>
<div class="outline-text-3" id="text-org1a26558">
<p>
コミュニティの皆さん、
</p>

<p>
OCaml 向けのシンプルなランタイムプロファイラ <b>Landmarks</b> の新しいリリースをお知らせします。
</p>

<p>
<a href="https://github.com/LexiFi/landmarks/releases/tag/v1.7">https://github.com/LexiFi/landmarks/releases/tag/v1.7</a>
</p>

<p>
このリリースの主な新機能は、外部ビューアで利用できるレポートを生成するカスタムバックエンドを定義できるようになったことです。<a href="https://www.speedscope.app/">https://www.speedscope.app/</a> レポートを生成するバックエンドの例が新ライブラリ <code>landmarks-speedscope</code> に含まれています。カスタムバックエンドは <code>landmarks</code> 自体を変更することなく外部ライブラリで定義できます。このサポートは @mjambon によって追加されました。
</p>

<p>
ハッピープロファイリング！
</p>

<p>
よろしくお願いします、
Nicolas
</p>
</div>
</div>
</div>




<div id="outline-container-7" class="outline-2">
<h2 id="7">Ocsigen が（今のところ）Lwt を使い続ける理由</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/why-ocsigen-is-staying-on-lwt-for-now/18318/1">https://discuss.ocaml.org/t/why-ocsigen-is-staying-on-lwt-for-now/18318/1</a>
</p>
</div>

<div id="outline-container-orgc80f778" class="outline-3">
<h3 id="orgc80f778">Vincent Balat が発表しました</h3>
<div class="outline-text-3" id="text-orgc80f778">
<p>
2025 年を通じて、Ocsigen スタック全体（ocsigenserver、Eliom、ocsigen-toolkit、ocsigen-start）を Lwt から Eio へ移行しました。移行はコンパイルが通り、テストスイートもパスしています。それでも私たちは<b><b>リリースしないことを決め、今のところ Lwt に留まることにしました</b></b>。その理由をまとめました。
</p>

<p>
2 つの障壁が私たちを止めました：
</p>

<ul class="org-ul">
<li><b><b>関数の色付けの喪失。</b></b> Lwt では、型中の `_ Lwt.t` により、呼び出しが中断したり I/O を行う可能性があることがわかります。Eliom のようなマルチティアフレームワークでは、これが非常に重要です。<b>同じ</b>共有式がサーバー上ではローカル呼び出しに、クライアント上ではネットワークラウンドトリップになる可能性があります。色付けがなければ、呼び出し元でスピナーをどこに置くべきかがわからず、リアクティブコンビネータ（<code>React</code> / <code>map_s</code>）がそれらが純粋であるという保証をサイレントに失ってしまいます。</li>
<li><b><b>Eio のハンドラモデル対ブラウザイベント。</b></b> クライアント側では、DOM イベントハンドラはスタック上に Eio ハンドラが存在しない状態でブラウザから直接呼び出されるため、`perform` が実行されるとクラッシュします。一般的な回避策（<code>Eio_js.start</code>）は <code>setTimeout(0)</code> を介してボディを遅延させますが、これはイベント伝播の後に実行されるため <code>preventDefault</code> / <code>stopPropagation</code> が機能しなくなります。</li>
</ul>

<p>
これは<b><b>Eio への反論ではありません</b></b>。エフェクトは OCaml 5 の大きな成果であり、マルチコアチームに感謝しています。モナドスタイルも実際には問題ありません（<code>let*</code> を使えば快適に書けます）。また、モナドが嫌いな方向けに <code>Lwt_direct</code> もあります。
</p>

<p>
私たちの幅広い懸念はエコシステムの統一性です。非常に大規模な Lwt コードベースが存在し、資金不足のプロジェクトはそのような移行を行う余裕がなく、分断は既に小さいコミュニティを傷つけることになります。支援のため、<a href="https://github.com/tarides/ciao-lwt"><code>ciao-lwt</code></a>（Lwt から Eio への移行ツール）をリリースしました。NLnet の NGI Zero Core および Tarides によって資金提供されています。Lwt 自体の改善（io_uring、エフェクト、マルチコア）を含め、私たちの障壁を取り除く方向性についてエフェクトコミュニティのご意見をぜひ聞きたいです。
</p>

<p>
詳細な記事: <a href="https://ocsigen.org/blog/posts/why-ocsigen-stays-on-lwt-for-now.html">https://ocsigen.org/blog/posts/why-ocsigen-stays-on-lwt-for-now.html</a>
</p>

<p>
フィードバック、アイデア、建設的な意見を歓迎します。
</p>
</div>
</div>
</div>




<div id="outline-container-8" class="outline-2">
<h2 id="8">Dune 3.24</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dune-3-24/18316/1">https://discuss.ocaml.org/t/ann-dune-3-24/18316/1</a>
</p>
</div>

<div id="outline-container-org82134d2" class="outline-3">
<h3 id="org82134d2">Shon が発表しました</h3>
<div class="outline-text-3" id="text-org82134d2">
<p>
Dune チームは <a href="https://github.com/ocaml/dune/releases/tag/3.24.0">dune 3.24.0 のリリース</a>をお知らせできることを嬉しく思います。
</p>

<p>
主なハイライトは以下の通りです：
</p>

<ul class="org-ul">
<li>Dune パッケージ管理がすべてのサポートされているコンパイラバージョンに対してデフォルトで relocatable コンパイラを使用するようになりました。これにより、ビルド済みのコンパイラバージョンを再利用できる多くのケースでワークスペースのセットアップが大幅に高速化されます。(<a href="https://github.com/ocaml/dune/pull/14357">ocaml/dune#14357</a>、<a href="https://github.com/Alizter">@Alizter</a>)</li>

<li>ディレクトリターゲットが一般提供になりました (<a href="https://github.com/ocaml/dune/pull/14579">ocaml/dune#14579</a>)。これにより、ツールがディレクトリツリー全体をターゲットとして生成できるようになります。詳細は <a href="https://dune.readthedocs.io/en/stable/reference/dune/rule.html#directory-targets">ディレクトリターゲットのドキュメント</a> をご覧ください。</li>

<li>パス処理が改善され、プラットフォーム間でのパスの一貫性が向上しました (<a href="https://github.com/ocaml/dune/pull/14278">ocaml/dune#14278</a> および <a href="https://github.com/ocaml/dune/pull/14278">ocaml/dune#14278</a>)。また、<code>%{bin:NAME}</code> 変数展開のためのより一貫した規律ある場所を使用するようになりました (<a href="https://github.com/ocaml/dune/pull/14432">ocaml/dune#14432</a>)。</li>

<li>パス値を持つパーセント形式（<code>%{bin:...}</code>、<code>%{dep:...}</code>、<code>%{path:...}</code> など）は、同一ディレクトリのパスを先頭の <code>./</code> 付きで展開するようになりました。これにより、<code>(bash ...)</code> や <code>(system ...)</code> アクションの <code>bash</code> などのシェルが、<code>PATH</code> で検索する代わりに直接実行するようになります (<a href="https://github.com/ocaml/dune/pull/15156">ocaml/dune#15156</a>)。これは、パスを素朴に扱い、テストフィクスチャや他の文字列の構築に使用する前に表現を正規化することを怠っていた設定にとっては破壊的変更です。</li>

<li>非推奨の <code>lang coq</code> は予定通り削除され、<code>lang rocq</code> に置き換えられました。詳細は <a href="https://github.com/ocaml/dune/issues/12788">ocaml/dune#12788</a> をご覧ください。</li>
</ul>

<p>
すべての新機能と修正、そしてそれらを可能にした貢献者への帰属については <a href="https://github.com/ocaml/dune/releases/tag/3.24.0">完全な変更履歴</a> をご覧ください。貢献者の皆さん、ありがとうございます！
</p>

<p>
このリリースで問題が発生した場合は、<a href="https://github.com/ocaml/dune/issues">issue トラッカー</a>にご報告ください。
</p>
</div>
</div>
</div>




<div id="outline-container-org5844e52" class="outline-2">
<h2 id="org5844e52">過去の CWN</h2>
<div class="outline-text-2" id="text-org5844e52">
<p>
CWN を見逃した場合は、<a href="mailto:alan.schmitt@polytechnique.org">メッセージを送っていただければ</a>メールでお送りします。また、<a href="https://ocaml.jp/cwn-ja/">アーカイブ</a>や<a href="https://ocaml.jp/cwn-ja/cwn.rss">RSS フィード</a>もご覧いただけます。
</p>

<p>
毎週メールで受け取りたい場合は、<a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a> を購読してください。
</p>

<div class="authorname" id="org10526a6">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>